Revit 2024 API
ToggleButtonData Class
This class contains information necessary to construct a toggle button in a RadioButtonGroup.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class ToggleButtonData : PushButtonData
Visual Basic
Public Class ToggleButtonData _
	Inherits PushButtonData
Visual C++
public ref class ToggleButtonData : public PushButtonData
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ButtonData
 Autodesk.Revit.UI.PushButtonData
 Autodesk.Revit.UI.ToggleButtonData
See Also
ToggleButtonData Members
Autodesk.Revit.UI Namespace